// ЗАДАЧА 1
// НАПИШІТЬ РЕЧЕННЯ ЗА ДОПОМОГОЮ ШАБЛОННОГО РЯДКА "ДОБРОГО ДНЯ,МЕНЕ ЗВАТИ ГАЛИНА, МЕНІ 35 РОКІВ, Я ВИВЧАЮ JAVASCRIPT"

// let username = "Галина";
// let age = 35;
// let subject = "JAVASCRIPT";

// console.log(`ДОБРОГО ДНЯ,МЕНЕ ЗВАТИ ${username}, МЕНІ ${age} РОКІВ, Я ВИВЧАЮ ${subject}`);



// ЗАДАЧА 2
// ЗАПИТАТИ У КОРИСТУВАЧА ІМЯ, ПОЧТУ , ТЕЛЕФОН, І ПОКАЗАТИ У КОНСОЛІ "КОРИСТУВАЧ __ ВИКОРИСТОВУЄ  __ ПОЧТУ І __ ТЕЛЕФОН"

// const name = prompt("Введіть своє імʼя");
// const email = prompt("Введіть свою пошту");
// const tel = prompt("Введіть свій телефон");

// alert(`КОРИСТУВАЧ ${name} ВИКОРИСТОВУЄ ${email} ПОЧТУ І ${tel} ТЕЛЕФОН`);

// ЗАДАЧА 3
// ПОТРІБНО ЗАПИТАТИ У МАГАЗИНІ ЦІНУ ЗА ТОВАР, ВВЕСТИ СУМУ 3-Х ТОВАРІВ І ВИВЕСТИ ЇХ ЗАГАЛЬНУ ЦІНУ

// let price1 = Number(prompt("Вкажіть ціну на телевізор"))
// let price2 = Number(prompt("Вкажіть ціну на телефон"))
// let price3 = Number(prompt("Вкажіть ціну на лептоп"))

// alert(`Загальна сума ${price1 + price2 + price3}`)

// ЗАДАЧА 4
// ВИКОРИСТОВУЮЧИ КОНСТРУКЦІЮ IF...ELSE , НАПИШИ КОД, ЯКИЙ БУДЕ ЗАПИТУВАТИ:
// "СКІЛЬКИ МІСЯЦІВ МАЄ РІК", ЯКЩО КОРИСТУВАЧ ВВОДИТЬ 12 ТО У КОНСОЛІ ПИШЕ ВІРНО, ЯКЩО НЕ ПРАВИЛЬНО КОРИСТУВАЧ ВВІВ, ТОДІ У КОНСОЛІ ПИШЕ
// "НЕ ЗНАЄТЕ? 12"

let monthNumber = Number(prompt("СКІЛЬКИ МІСЯЦІВ МАЄ РІК"));

// if (monthNumber === 12) {
//     console.log("Вірно");
// }
// else {
//     console.log("НЕ ЗНАЄТЕ? 12");
// }

let someVar = monthNumber === 12 ? "Вірно" : "НЕ ЗНАЄТЕ? 12";
console.log(someVar);